pickupAvailability/xml/pickupAvailability.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/pickup/v11">
   <SOAP-ENV:Body>
      <PickupAvailabilityRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key/>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber/>
            <MeterNumber/>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId/>
         </TransactionDetail>
         <Version>
            <ServiceId>disp</ServiceId>
            <Major>11</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <PickupAddress/>
         <PickupRequestType/>
         <DispatchDate/>
         <PackageReadyTime/>
         <CustomerCloseTime/>
		 <Carriers/>
		 <ShipmentAttributes>
		 	<Dimensions>
				<Length/>
				<Width/>
				<Height/>
				<Units/>
			</Dimensions>
			<Weight>
				<Units/>
				<Value/>
			 </Weight>
		 </ShipmentAttributes>
      </PickupAvailabilityRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
